# 'brew tap'
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "jasonbirchall/crypto-tap"
tap "ministryofjustice/cloud-platform-tap"
tap "shopify/shopify"

# 'brew tap' with custom Git URL
# e.g tap "user/tap-repo", "https://user@bitbucket.org/user/homebrew-tap-repo.git"

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications", require_sha: true

# 'brew install'
brew "ack"
brew "ansible"
brew "awscli"
brew "bat"
brew "commitizen"
brew "exercism"
brew "fd"
brew "fzf"
brew "gh"
brew "git-cola"
brew "git-crypt"
brew "gnupg"
brew "go"
brew "helix"
brew "helm"
brew "k9s"
brew "kube-linter"
brew "kubernetes-cli"
brew "lazygit"
brew "lua-language-server"
brew "luarocks"
brew "mas"
brew "ministryofjustice/cloud-platform-tap/cloud-platform-cli"
brew "neovim"
brew "ninja"
brew "node@16"
brew "operator-sdk"
brew "pyenv"
brew "pyenv-virtualenv"
brew "ranger"
brew "spotify-tui"
brew "starship"
brew "staticcheck"
brew "stern"
brew "stylua"
brew "themekit"
brew "tig"
brew "tmux"
brew "tree"
brew "watch"
brew "yarn"
brew "yq"

# 'brew install --cask'
cask "amethyst"
cask "anki"
cask "brave-browser"
cask "firefox"
cask "fly"
cask "font-hack-nerd-font"
cask "gpg-suite"
cask "jetbrains-toolbox"
cask "signal"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "warp"
cask "zoom"

# 'mas install'
#mas "1Password", id: 443987910

# 'whalebrew install'
#whalebrew "whalebrew/wget"
